export interface faqsProps {
    id: string;
    question: string;
    answer: string;
}

export const FAQQuestions:faqsProps[] = [
    {
        id: "1",
        question: "นักเรียนระดับชั้นอะไรสามารถสมัครได้คะ ?",
        answer: "ชั้นมัธยมศึกษาปีที่ 4 และมัธยมศึกษาปีที่ 5 ในปีการศึกษา 2568 ค่ะ",
    },
    {
        id: "2",
        question: "นักเรียนที่กำลังจะขึ้น ม.6 ในปีการศึกษาหน้า สามารถสมัครได้ไหมคะ ?",
        answer: "สมัครได้ค่ะ โดยการรับสมัครนักเรียนชั้น ม.4 - 5 ในปีการศึกษา 2568 หมายถึง การเปิดรับสมัครนักเรียนที่กำลังจะขึ้นชั้น ม.5 - 6 ในปีการศึกษา 2569 นี้ค่ะ",
    },
    {
        id: "3",
        question: "เรียน ปวช. สามารถสมัครได้ไหมครับ ?",
        answer: "สมัครได้ค่ะ โดยรับนักเรียน ปวช.1 - 2 ปีการศึกษา 2568 ค่ะ",
    },
    {
        id: "4",
        question: "สามารถใช้ใบเกรดในการสมัครแทนเอกสาร ปพ.1 ได้ไหมคะ ?",
        answer: "สามารถใช้แทนได้ค่ะ แต่ต้องเป็นผลการเรียนของภาคปีการศึกษาล่าสุดเท่านั้นนะคะ",
    },
    {
        id: "5",
        question: "สามารถใช้เอกสารใบรับรองการเป็นนักเรียนจากภาคเรียนที่ 1 ได้ไหมคะ ?",
        answer: "ใบรับรองสถานภาพการเป็นนักเรียนมีอายุ 120 วัน นับจากวันที่ออกเอกสาร หากยังอยู่ภายในระยะเวลาดังกล่าวสามารถใช้ได้ค่ะ",
    },
    {
        id: "6",
        question: "สามารถใช้เอกสาร ปพ.1 หรือ ปพ.7 เพียงอย่างใดอย่างหนึ่งในการสมัครหรือจำเป็นต้องใช้ทั้งสองฉบับคะ ?",
        answer: "จำเป็นต้องใช้ทั้งสองฉบับค่ะ",
    },
    {
        id: "7",
        question: "หนังสือขออนุญาตผู้ปกครอง ต้องเตรียมยังไงคะ",
        answer: "น้อง ๆ สามารถโหลดได้ที่เว็บไซต์ค่ายในวันที่เปิดรับสมัครนะคะ",
    },
    {
        id: "8",
        question: "ค่ายเปิดรับสมัครถึงวันไหนคะ",
        answer: "ค่ายเปิดรับสมัครตั้งแต่วันที่ 23 กุมภาพันธ์ - 10 มีนาคม 2569 ค่ะ",
    },
    {
        id: "9",
        question: "ถ้าเรียนเตรียมวิศวะอยู่ สมัครค่ายนี้ได้ไหมครับ",
        answer: "สมัครได้ค่ะ",
    },
    {
        id: "10",
        question: "กรณีเป็นเด็กต่างจังหวัด พอจะมีคำแนะนำในการเดินทางมาค่ายไหมครับ",
        answer:
            "หากน้อง ๆ เดินทางมาจากต่างจังหวัด สามารถเดินทางมาตามจุดนัดพบที่ระบุไว้ในใบสมัครได้เลยค่ะ และในวันเข้าร่วมโครงการ จะมีพี่ ๆ ไปดูแลและอำนวยความสะดวกในการเดินทางค่ะ",
    },
    {
        id: "11",
        question: "รูปแบบการจัดค่ายเป็นแบบ Onsite หรือเปล่าคะ",
        answer:
            "รูปแบบค่ายจัดแบบ Onsite ที่ภาควิชาวิศวกรรมคอมพิวเตอร์ อาคารวิศววัฒนะ (ตึกแดง) ชั้น 10 - 11 มหาวิทยาลัยเทคโนโลยีพระจอมเกล้าธนบุรีค่ะ",
    },
    {
        id: "12",
        question: "ถ้าไม่มีพื้นฐานทางด้านคอมพิวเตอร์ สามารถสมัครได้ไหมครับ",
        answer:
            "เพียงแค่มีความสนใจทางด้านคอมพิวเตอร์ ไม่จำเป็นต้องมีพื้นฐานมาก่อนก็สามารถสมัครได้ค่ะ",
    },
    {
        id: "13",
        question: "ต้องขอเอกสารจากทางโรงเรียนไหมคะ",
        answer:
            "เอกสารที่ต้องขอกับทางโรงเรียน ได้แก่ ปพ.1 (ใบแสดงผลการเรียน) และ ปพ.7 (เอกสารรับรองการเป็นนักเรียน) ค่ะ",
    },
    {
        id: "14",
        question: "ค่ายนี้มีเรียนอะไรบ้างครับ",
        answer:
            "ค่าย ComCamp 37 จะมีการสอนทั้งหมด 3 วิชา ได้แก่ C Programming, Microcontroller เเละ AI อีกทั้งยังมีการทำมินิโปรเจกต์เพื่อให้น้อง ๆ ได้นำสิ่งที่น้อง ๆ เรียนรู้มาใช้แก้ไขปัญหาร่วมกันภายในค่ายค่ะ",
    },
    {
        id: "15",
        question: "ค่ายนี้ต้องค้างคืนไหมคะ แล้วพักที่ไหนคะ",
        answer:
            "ค่ายนี้จะมีการค้างคืนทั้งหมด 4 คืน โดยจะมีที่พักที่จัดเตรียมไว้ไห้ ซึ่งจะมีพี่ ๆ CPE ดูแลตลอด 24 ชั่วโมงค่ะ",
    },
    {
        id: "16",
        question: "ในการเข้าค่ายนี้ จะได้รับเกียรติบัตรไหมครับ",
        answer: "น้อง ๆ ที่เข้าร่วมค่ายนี้จะได้รับเกียรติบัตรจากค่ายค่ะ",
    },
    {
        id: "17",
        question: "ค่ายนี้มีเกณฑ์ในการรับคนอย่างไรบ้างคะ",
        answer:
            "เกณฑ์ในการคัดเลือกจะพิจารณาจากข้อมูลและความถูกต้องในใบสมัคร ประกอบกับพิจารณาจากการตอบคำถามของน้อง ๆ ที่ส่งเข้ามาด้วยค่ะ",
    },
]