"use client";

import {Navbar} from "@/components/ui/navbar";
import {Footer} from "@/components/ui/footer";

export default function Privacy() {
    return (
      <>
      <div className='w-full h-full bg-[#1F456E] text-white scroll-smooth'>
        {/* <div className='bg-[#212738] flex justify-center font-bold py-8 sticky top-0 z-1'>banner</div> */}
        <div className='flex justify-center'>
            <div className='font-zootopia text-center w-full flex flex-col items-center justify-center font-bold text-5xl px-15 pt-26 pb-3 bg-gradient-to-b from-[#1F456E] to-[#151E3D]'>
            Privacy Policy <br />
            <span className='text-center font-bai_jamjuree text-sm mt-5 opacity-40'>Last updated: 26/01/2026</span>
            </div>
        </div>
        <div className="top-0 left-0 w-full overflow-hidden leading-[0]">
            <div className="w-full -mt-[10vh] h-[20vh] bg-[#151E3D] [clip-path:ellipse(80%_100%_at_50%_0%)] mb-10">
            </div>
        </div>

        <div className='flex justify-around'>
          <nav className=' font-bold min-w-70 max-h-80 pt-0 text-lg bg-[#151E3D] m-10 mt-0 mr-10 rounded-2xl self-start
          sticky top-24 w-1/4 max-h-[calc(60vh-5rem)] hidden md:flex flex-col
  '>
              <p className="sticky flex justify-center bg-[#151E3D] p-5 px-20 top-0 w-full m-0 border-b border-white/10 rounded-t-2xl">Navigation</p>
              <br />
              <ul className='overflow-y-auto px-4 pb-4 text-sm/6'>
                  {[
                      { id: "#p1", label: "นโยบายความเป็นส่วนตัว" },
                      { id: "#p2", label: "การเก็บรวบรวมข้อมูลส่วนบุคคล" },
                      { id: "#p3", label: "ประเภทข้อมูลส่วนบุคคลที่เก็บรวบรวม" },
                      { id: "#p4", label: "ผู้เยาว์" },
                      { id: "#p5", label: "วิธีการเก็บรักษาข้อมูลส่วนบุคคล" },
                      { id: "#p6", label: "การประมวลผลข้อมูลส่วนบุคคล" },
                      { id: "#p7", label: "การเปิดเผยข้อมูลส่วนบุคคล" },
                      { id: "#p8", label: "ระยะเวลาจัดเก็บข้อมูลส่วนบุคคล" },
                      { id: "#p9", label: "สิทธิของเจ้าของข้อมูลส่วนบุคคล" },
                      { id: "#p10", label: "คุกกี้ที่เราใช้งาน" },
                      { id: "#p11", label: "การรักษาความมั่นคงปลอดภัย" },
                      { id: "#p12", label: "การแจ้งเหตุละเมิดข้อมูลส่วนบุคคล" },
                      { id: "#p13", label: "รายละเอียดการติดต่อ" },
                  ].map((item) => (
                      <li key={item.id} className="mb-1">
                          <a href={item.id} className="block group">
                              <div className="flex items-start gap-3 px-3 py-2 rounded-md hover:bg-slate-900/90 transition duration-100 ease-linear">
                                  <span className="mt-2 w-1.5 h-1.5 rounded-full bg-white shrink-0 group-hover:bg-theme-secondary transition-all " />
                                  <span className="group-hover:pl-1 transition-all">{item.label}</span>
                              </div>
                          </a>
                      </li>
                  ))}
              </ul>
          </nav>
          <div className='[&_section]:scroll-mt-24 [&_span]:text-xl/12 [&_span]:font-bold [&_span]:-ml-6 [&_span]:inline-block [&_span]:indent-0
           [&_ul]:list-disc [&_ul]:list-outside [&_ul]:ml-4 [&_ul]:ml-16 [&_p]:ml-2 px-12 text-base/8 pb-10 [&_p:not(.ignores)]:indent-8'>
            <section id="p1">
              <span>1. นโยบายความเป็นส่วนตัว</span><br />
                <p>โครงการฝึกอบรมเชิงปฏิบัติการคอมพิวเตอร์ ครั้งที่ 37 ให้ความสําคัญกับการคุ้มครองข้อมูลส่วนบุคคลของคุณ
              โดยนโยบายความเป็นส่วนตัวฉบับนี้ได้อธิบายแนวปฏิบัติเกี่ยวกับการเก็บรวบรวม ใช้ หรือ เปิดเผยข้อมูลส่วนบุคคลรวมถึงสิทธิต่าง ๆ
              ของเจ้าของข้อมูลส่วนบุคคล ตามกฎหมายคุ้มครองข้อมูลส่วนบุคคล</p>
            </section>
            <br />
            <section id="p2">
              <span>2. การเก็บรวบรวมข้อมูลส่วนบุคคล</span><br />
              <p>เราจะเก็บข้อมูลส่วนบุคคลที่ได้รับโดยตรงจากคุณผ่านช่องทาง ดังต่อไปนี้</p>
              <ul>
                <li>การรับสมัครเข้าร่วมโครงการ</li>
              </ul>
            </section>
            <br />
            <section id="p3">
              <span>3. ประเภทข้อมูลส่วนบุคคลที่เก็บรวบรวม</span><br />
                <ul>
                  <li><strong>ข้อมูลส่วนบุคคล</strong> เช่น ชื่อ นามสกุล อายุ วัน/เดือน/ปีเกิด สัญชาติ เลขประจำตัวประชาชน เป็นต้น</li>
                  <li><strong>ข้อมูลการติดต่อ</strong> เช่น ที่อยู่ หมายเลขโทรศัพท์ อีเมล เป็นต้น</li>
                  <li><strong>ข้อมูลบัญชี</strong> เช่น บัญชีผู้ใช้งาน ประวัติการใช้งาน เป็นต้น</li>
                  <li><strong>หลักฐานแสดงตัวตน</strong> เช่น สำเนาบัตรประจำตัวประชาชน เอกสารรับรองการเป็นนักเรียน เป็นต้น</li>
                  <li><strong>ข้อมูลอื่นๆ</strong> เช่น รูปภาพและข้อมูลอื่นใดที่ถือว่าเป็นข้อมูลส่วนบุคคลตามกฎหมายคุ้มครองข้อมูลส่วนบุคคล เราจะเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลอ่อนไหว ดังต่อไปนี้ เมื่อเราได้รับความยินยอมโดยชัดแจ้งจากคุณ เว้นแต่กฎหมายกำหนดให้ทำได้</li>
                  <li><strong>ข้อมูลสุขภาพ</strong></li>
                  
                </ul>
            </section>
            <br />
            <section id="p4">
              <span>4. ผู้เยาว์</span><br />
              <p>หากคุณมีอายุต่ำกว่า 20 ปีหรือมีข้อจํากัดความสามารถตามกฎหมาย เราอาจเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลของคุณ เราอาจจําเป็นต้องให้พ่อแม่หรือผู้ปกครองของคุณให้ความยินยอมหรือที่กฎหมายอนุญาตให้ทําได้ หากเราทราบว่ามีการเก็บรวบรวมข้อมูลส่วนบุคคลจากผู้เยาว์โดยไม่ได้รับความยินยอมจากพ่อแม่หรือผู้ปกครอง เราจะดําเนินการลบข้อมูลนั้นออกจากฐานข้อมูลของเรา</p>
            </section>
            <br />
            <section id="p5">
              <span>5. วิธีการเก็บรักษาข้อมูลส่วนบุคคล</span><br />
              <p>เราจะเก็บรักษาข้อมูลส่วนบุคคลของคุณในรูปแบบเอกสารและรูปแบบอิเล็กทรอนิกส์</p>
            </section>
            <br />
            <section id="p6">
              <span>6. การประมวลผลข้อมูลส่วนบุคคล</span><br />
              <p>เราจะเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลของคุณเพื่อวัตถุประสงค์ดังต่อไปนี้</p>
              <ul>
                <li>เพื่อยืนยันว่าผู้สมัครมีตัวตนจริง</li>
                <li>เพื่อใช้ประกอบการพิจารณาคุณสมบัติของผู้สมัครตามที่โครงการกำหนด</li>
                <li>เพื่อปฏิบัติตามกฎหมายและกฎระเบียบของหน่วยงานราชการ</li>
              </ul>
            </section>
            <br />
            <section id="p7">
              <span>7. การเปิดเผยข้อมูลส่วนบุคคล</span><br />
              <p>เราอาจเปิดเผยข้อมูลส่วนบุคคลของคุณเท่าที่จำเป็นให้เจ้าหน้าที่ภายในโครงการภายใต้ความยินยอมของคุณหรือที่กฎหมายอนุญาตให้เปิดเผยได้ เพื่อการบริหารจัดการโครงการอย่างมีประสิทธิภาพ</p>
            </section>
            <br />
            <section id="p8">
              <span>8. ระยะเวลาจัดเก็บข้อมูลส่วนบุคคล</span><br />
              <p>เราจะเก็บรักษาข้อมูลส่วนบุคคลของคุณไว้ตามระยะเวลาที่จําเป็นสำหรับการบรรลุวัตถุประสงค์ตามนโยบายนี้ ซึ่งอาจจําเป็นต้องเก็บรักษาไว้ต่อไปภายหลังจากนั้น หากมีกฎหมายกําหนดไว้เราจะลบ ทําลาย หรือทําให้เป็นข้อมูลที่ไม่สามารถระบุตัวตนของคุณได้ เมื่อหมดความจําเป็นหรือสิ้นสุดระยะเวลาดังกล่าว</p>
            </section>
            <br />
            <section id="p9">
              <span>9. สิทธิของเจ้าของข้อมูลส่วนบุคคล</span><br />
              <p>ภายใต้กฎหมายคุ้มครองข้อมูลส่วนบุคคล คุณมีสิทธิในการดำเนินการดังต่อไปนี้</p>
              <ul>
                <li><strong>สิทธิขอถอนความยินยอม (Right to withdraw consent)</strong> หากคุณได้ให้ความยินยอม เราจะเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลของคุณ ไม่ว่าจะเป็นความยินยอมที่คุณให้ไว้ก่อนวันที่กฎหมายคุ้มครองข้อมูลส่วนบุคคลใช้บังคับหรือหลังจากนั้น คุณมีสิทธิที่จะถอนความยินยอมเมื่อใดก็ได้ตลอดเวลา เป็นต้น</li>
                <li><strong>สิทธิขอเข้าถึงข้อมูล (Right to access)</strong> คุณมีสิทธิขอเข้าถึงข้อมูลส่วนบุคคลของคุณที่อยู่ในความรับผิดชอบของเราและขอให้เราทำสําเนาข้อมูลดังกล่าวให้แก่คุณ รวมถึงขอให้เราเปิดเผยว่าเราได้ข้อมูลส่วนบุคคลของคุณมาได้อย่างไร</li>
                <li><strong>สิทธิขอถ่ายโอนข้อมูล (Right to data portability)</strong> คุณมีสิทธิขอรับข้อมูลส่วนบุคคลของคุณในกรณีที่เราได้จัดทำข้อมูลส่วนบุคคลนั้นอยู่ในรูปแบบให้สามารถอ่านหรือใช้งานได้ด้วยเครื่องมือหรืออุปกรณ์ที่ทำงานได้โดยอัตโนมัติและสามารถใช้หรือเปิดเผยข้อมูลส่วนบุคคลได้ด้วยวิธีการอัตโนมัติ รวมทั้งมีสิทธิขอให้เราส่งหรือโอนข้อมูลส่วนบุคคลในรูปแบบดังกล่าวไปยังผู้ควบคุมข้อมูลส่วนบุคคลอื่นเมื่อสามารถทำได้ด้วยวิธีการอัตโนมัติ และมีสิทธิขอรับข้อมูลส่วนบุคคลที่เราส่งหรือ โอนข้อมูลส่วนบุคคลในรูปแบบดังกล่าวไปยังผู้ควบคุมข้อมูลส่วนบุคคลอื่นโดยตรง เว้นแต่ไม่สามารถดำเนินการได้เพราะเหตุทางเทคนิค</li>
                <li><strong>สิทธิขอคัดค้าน (Right to object)</strong> คุณมีสิทธิขอคัดค้านการเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลของคุณในเวลาใดก็ได้ หากการเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลของคุณที่ทําขึ้นเพื่อการดําเนินงานที่จําเป็นภายใต้ประโยชน์โดยชอบด้วยกฎหมายของเราหรือของบุคคลหรือนิติบุคคลอื่น โดยไม่เกินขอบเขตที่คุณสามารถคาดหมายได้อย่างสมเหตุสมผลหรือเพื่อดําเนินการตามภารกิจเพื่อสาธารณประโยชน์</li>
                <li><strong>สิทธิขอให้ลบหรือทําลายข้อมูล (Right to erasure/destruction)</strong> คุณมีสิทธิขอลบหรือทำลายข้อมูลส่วนบุคคลของคุณหรือทำให้ข้อมูลส่วนบุคคลเป็นข้อมูลที่ไม่สามารถระบุตัวคุณได้ หากคุณเชื่อว่าข้อมูลส่วนบุคคลของคุณถูกเก็บรวบรวม ใช้ หรือเปิดเผยโดยไม่ชอบด้วยกฎหมายที่เกี่ยวข้องหรือเห็นว่าเราหมดความจําเป็นในการเก็บรักษาไว้ตามวัตถุประสงค์ที่เกี่ยวข้องในนโยบายฉบับนี้หรือเมื่อคุณได้ใช้สิทธิขอถอนความยินยอมหรือใช้สิทธิขอคัดค้านตามที่แจ้งไว้ข้างต้นแล้ว</li>
                <li><strong>สิทธิขอให้ระงับการใช้ข้อมูล (Right to restriction of processing)</strong> คุณมีสิทธิขอให้ระงับการใช้ข้อมูลส่วนบุคคลชั่วคราวในกรณีที่เราอยู่ระหว่างตรวจสอบตามคําร้องขอใช้สิทธิขอแก้ไขข้อมูลส่วนบุคคลหรือขอคัดค้านของคุณหรือกรณีอื่นใดที่เราหมดความจําเป็นและต้องลบหรือทำลายข้อมูลส่วนบุคคลของคุณตามกฎหมายที่เกี่ยวข้องแต่คุณขอให้เราระงับการใช้แทน</li>
                <li><strong>สิทธิขอให้แก้ไขข้อมูล (Right to rectification)</strong> คุณมีสิทธิขอแก้ไขข้อมูลส่วนบุคคลของคุณให้ถูกต้อง เป็นปัจจุบัน สมบูรณ์และ ไม่ก่อให้เกิดความเข้าใจผิด</li>
                <li><strong>สิทธิร้องเรียน (Right to lodge a complaint)</strong> คุณมีสิทธิร้องเรียนต่อผู้มีอำนาจตามกฎหมายที่เกี่ยวข้อง หากคุณเชื่อว่าการเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลของคุณเป็นการกระทำในลักษณะที่ฝ่าฝืนหรือไม่ปฏิบัติตามกฎหมายที่เกี่ยวข้อง</li>
              </ul>
              <p className="ignores">คุณสามารถใช้สิทธิของคุณในฐานะเจ้าของข้อมูลส่วนบุคคลข้างต้นได้ โดยติดต่อมาที่เจ้าหน้าที่คุ้มครองข้อมูลส่วนบุคคลของเราตามรายละเอียดท้ายนโยบายนี้ เราจะแจ้งผลการดำเนินการภายในระยะเวลา 30 วัน นับแต่วันที่เราได้รับคำขอใช้สิทธิจากคุณ ตามแบบฟอร์มหรือวิธีการที่เรากำหนด ทั้งนี้ หากเราปฏิเสธคำขอเราจะแจ้งเหตุผลของการปฏิเสธให้คุณทราบผ่านช่องทางต่าง ๆ เช่น อีเมล โทรศัพท์ เป็นต้น</p>
            </section>
            <br />
            <section id="p10">
              <span>10. คุกกี้ที่เราใช้งาน</span><br />
              <ul>
                <li><strong>คุกกี้ที่มีความจำเป็นอย่างยิ่ง (Necessary Cookies)</strong> คุกกี้ที่มีความจำเป็นอย่างยิ่งช่วยให้เราสามารถนำเสนอประสบการณ์ที่ดีที่สุดเมื่อท่านเข้าถึงและสำรวจเว็บไซต์ของเราและใช้งานคุณสมบัติต่าง ๆ ตัวอย่างเช่น คุกกี้เหล่านี้แจ้งให้เราทราบว่าท่านได้ทำการสร้างบัญชีและได้ลงชื่อเข้าใช้บัญชีนั้นเพื่อเข้าถึงเนื้อหา</li>
              </ul>
            </section>
            <br />
            <section id="p11">
              <span>11. การรักษาความมั่นคงและความปลอดภัยของข้อมูลส่วนบุคคล</span><br />
              <p>เราจะรักษาความมั่นคงปลอดภัยของข้อมูลส่วนบุคคลของคุณไว้ตามหลักการ การรักษาความลับ(confidentiality) ความถูกต้องครบถ้วน (integrity) และสภาพพร้อมใช้งาน (availability) ทั้งนี้ เพื่อป้องกันการสูญหาย เข้าถึง ใช้ เปลี่ยนแปลง แก้ไข หรือเปิดเผย นอกจากนี้เราจะจัดให้มีมาตรการรักษาความมั่นคงปลอดภัยของข้อมูลส่วนบุคคล ซึ่งครอบคลุมถึงมาตรการป้องกันด้านการบริหารจัดการ (administrative safeguard) มาตรการป้องกันด้านเทคนิค (technical safeguard) และมาตรการป้องกันทางกายภาพ (physical safeguard) ในเรื่องการเข้าถึงหรือควบคุมการใช้งานข้อมูลส่วนบุคคล (access control)</p>
            </section>
            <br />
            <section id="p12"> 
              <span>12. การแจ้งเหตุละเมิดข้อมูลส่วนบุคคล</span><br />
              <p>ในกรณีที่มีเหตุละเมิดข้อมูลส่วนบุคคลของคุณเกิดขึ้น เราจะแจ้งให้สำนักงานคณะกรรมการคุ้มครองข้อมูลส่วนบุคคลทราบโดยไม่ช้าภายใน 72 ชั่วโมง นับแต่ทราบเหตุเท่าที่สามารถกระทำได้ ในกรณีที่การละเมิดมีความเสี่ยงสูงที่จะมีผลกระทบต่อสิทธิและเสรีภาพของคุณ เราจะแจ้งการละเมิดให้คุณทราบพร้อมกับแนวทางการเยียวยาโดยไม่ชักช้าผ่านช่องทางต่าง ๆ เช่น เว็บไซต์ อีเมล โทรศัพท์ เป็นต้น</p>
            </section>
            <br />
            <section id="p13">
              <span>13. รายละเอียดการติดต่อ</span><br />
              <p>หากคุณมีข้อสงสัย ประสงค์จะสอบถามข้อมูลเพิ่มเติมเกี่ยวกับนโยบายการคุ้มครองข้อมูลส่วนบุคคล รวมถึงการใช้สิทธิของเจ้าของข้อมูลในการดำเนินการอย่างหนึ่งอย่างใดกับข้อมูลส่วนบุคคลของคุณ คุณสามารถติดต่อเจ้าหน้าที่คุ้มครองข้อมูลส่วนบุคคลได้ตามรายละเอียดการติดต่อดังต่อไปนี้</p>
            </section>
            <br/>
            <footer className="-ml-6 [&_p]:ml-0 -ml-2">
              <h1 className="font-bold ml-2">หัวหน้าฝ่ายทะเบียน</h1>
              <p className="ignores">นายชัยกร ประพันธ์พงพินิจ<br/>อีเมล : chaiyakorn.prap@mail.kmutt.ac.th<br/>เบอร์โทรศัพท์ : 065-728-5679</p>
            </footer>
          </div>
        </div>
      </div>
          <Footer/>
    </>
    );
}